Public Member Functions | Friends | List of all members
ACAPI::Tracking::TrackerManager Class Reference
Tracker Manager | Tracker API
TrackerManager is a class to access the main tracker with. More...
#include <TrackerManager.hpp>
 Inheritance diagram for ACAPI::Tracking::TrackerManager:
 Public Member Functions
Result< TrackerRef >  | GetMainTracker () const
Returns the main tracker.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< TrackerManager >  | GetTrackerManager ()
A function to create TrackerManager instance.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
TrackerManager is a class to access the main tracker with.
Since
Archicad 28
Member Function Documentation
◆ GetMainTracker()
 Result< TrackerRef > ACAPI::Tracking::TrackerManager::GetMainTracker  |  ( |   | ) |   const
Returns the main tracker.
Returns
Returns a reference to the main tracker if the process succeeds, otherwise returns an error.
APIERR_GENERAL - The main tracker is missing, which is an invalid state.
Example code snippets from Test / Tracker Manager
 ACAPI::Result<ACAPI::Tracking::TrackerManager> manager = ACAPI::Tracking::GetTrackerManager ();
 if (manager.IsErr ()) {
 WriteReport ("Could not instantiate the Tracker Manager.");
 return;
 }
 ACAPI::Result<ACAPI::Tracking::TrackerRef> trackerRef = manager->GetMainTracker ();
 if (trackerRef.IsErr ()) {
 const auto& err = trackerRef.UnwrapErr ();
 WriteReport ("%i: %s", err.kind, err.text.c_str ());
 return;
 }
 Tracking::Tracker& tracker = trackerRef.Unwrap ();
 if (!tracker.IsVisible ()) {
 WriteReport ("The main tracker is hidden.");
 return;
 }
 const bool isAnyTrackerItemVisible = tracker.EnumerateVisibleItems () != nullptr;
 if (isAnyTrackerItemVisible) {
 WriteReport ("The main tracker is visible.");
 } else {
 WriteReport ("The main tracker could be visible but has no item to be shown.");
 }
Friends And Related Symbol Documentation
◆ GetTrackerManager
 Result< TrackerManager > GetTrackerManager  |  ( |   | )
friend
A function to create TrackerManager instance.
Returns
Returns the TrackerManager instance. This process cannot fail.